RailsApi/things-we-google-api/app/controllers/favorites_controller.rb

    def create
        favorite = Favorite.new(favorite_params)
        if favorite.save
---
INSERT INTO "favorites" ("user_id", "search_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 9], ["search_id", 0], ["created_at", "2019-11-15 18:17:13.840970"], ["updated_at", "2019-11-15 18:17:13.840970"]]

    def index
        user_id = params[:user_id]
        @user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def destroy
        fav_id = params[:id]
        favorite = Favorite.find(fav_id)
        favorite.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 23]]