RailsApi/things-we-google-api/app/controllers/searches_controller.rb

SELECT "searches".* FROM "searches"
---
    def index
        searches = Search.all

INSERT INTO "searches" ("content", "created_at", "updated_at", "link") VALUES (?, ?, ?, ?)  [["content", "fgfgf"], ["created_at", "2019-11-19 22:36:18.709618"], ["updated_at", "2019-11-19 22:36:18.709618"], ["link", "http://www.fgfgf.com"]]
---
    def create
        search = Search.new(search_params)
        if search.save