RailsApi/things-we-google-api/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "ass"], ["created_at", "2019-11-15 18:06:12.822544"], ["updated_at", "2019-11-15 18:06:12.822544"]]
---
    def create
        user = User.new(user_params)
        # user = User.find_or_create_by(email: params[:user][:email])
        # user = User.find_or_create_by(user_params)
        if user.save